NJC_ThermalComfort/0/treeBlanking
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class      volScalarField;
location   0;
object     treeBlanking;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

dimensions	  [0 0 0 0 0 0 0];

internalField	  uniform -1.0;

boundaryField
	{
	 "procBoundary.*" 
	 	 { 
	 	 	 type processor;
	 	}
	 west 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 east 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 north 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 south 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 upper 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 nonstl 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 NJC_Aesthetic 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 NJC_Main 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 NJC_TD_Block 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 NJC_Weights_Room 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 bufferstl 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	 lower 
 	 	 { 
	 	 	 type zeroGradient;
	 	 	  
	 	 	 value uniform 0.0;
	 	 }
	}
