NJC_ThermalComfort/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object     transportProperties;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

transportModel Newtonian;
rhoRef 1.225;
"cpRef|CpRef" 1000.0;
nu nu [0 2 -1 0 0 0 0] 1e-05; 
Pr 0.9;
Prt 0.7;
