NJC_ThermalComfort/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object     blockMeshDict;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

scale 1.0;

vertices
(
(-3750.952358 -2165.406250 0.000000)
(4294.915371 -2165.406250 0.000000)
(4294.915371 3012.406250 0.000000)
(-3750.952358 3012.406250 0.000000)
(-3750.952358 -2165.406250 625.000000)
(4294.915371 -2165.406250 625.000000)
(4294.915371 3012.406250 625.000000)
(-3750.952358 3012.406250 625.000000)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (535 345 36) simpleGrading 
(
(
( 0.423810 0.200000 0.035115)
( 0.160000 0.600000 1.000000)
( 0.423810 0.200000 28.477934)
)
(
( 0.423810 0.200000 0.036001)
( 0.160000 0.600000 1.000000)
( 0.423810 0.200000 27.776964)
)
(
( 0.185600 0.800000 1.000000)
( 0.814400 0.200000 79.279049)
)
)
);
edges
(
);


boundary
(
lower
{
type wall;
faces
(
(0 3 2 1)
);
}
upper
{
type patch;
faces
(
(4 5 6 7)
);
}
west
{
type patch;
neighbourPatch east;
faces
(
(0 4 7 3)
);
}
east
{
type patch;
neighbourPatch west;
faces
(
(1 2 6 5)
);
}
north
{
type patch;
neighbourPatch south;
faces
(
(3 7 6 2)
);
}
south
{
type patch;
neighbourPatch north;
faces
(
(0 1 5 4)
);
}
);



mergePatchPairs
(
);

// ************************************************************************* // 

